# 1) У вас есть список чисел от 1 до 10,Напишите код, чтобы создать новый
# список. содержащий квадраты только четных чисел из исходного списка,
# использовать comprehension .
# d = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
# d_ = {i for i in range(11) if i % 1 == 0}
# print(d_)

# # 2)У вас есть словарь содержащий названия предметов в качестве ключей и
# их оценки в виде чисел Напишите код чтобы создать новый словарь где
# ключами будут те же оценки а значениями будут значения True или False,
# True будет если оценка будет равна или больше 4

# пример) ratings = {item: 1, item2: 5, item: 4}

# вывод >>> {item: False, item2: True, Item: True}

# ratings_ = {item: 1, item2: 5, item: 4}
# new_rating_ = ['четное' if i % 2 == 0 else 'нечетное' for i in ratings_]

# list_ = [12, 3, 0, 34, 9, 7]
# new_list_ = ['четное' if i % 2 == 0 else 'нечетное' for i in list_]
# print(new_list_) # ['четное', 'нечетное', 'четное', 'четное', 'нечетное', 'нечетное']

# 3) У вас есть список чисел. Напишите код, который попытается получить
# элемент по индексу, введенному пользователем, из этого списка. Если
# индекс выходит за пределы списка, программа должна вывести сообщение
# о выходе за пределы списка.

# numbers_list = [1, 3, 5, 7, 8 , 12]
# numbers_list = input('введите число ')
# if numbers_list.index():
#     print(a)
# else:
#     print('ошибка')

# 4) Напишите функцию check_numbers(), которая принимает число в
# качестве аргумента и возвращает булево значение True, если число четное,
# и False, если число нечетное.

# 5) Напишите функцию length_text() которая принимает текстовую строку
# и возвращает список длин слов в этой строке

# 6) напишите как создать виртуальное окружение и назовите его makers

# 7) Напишите функцию length(), чтобы она определяла количество цифр в
# числе, не используя преобразование числа в строку. Для этого используйте
# логику и математические операции.

# >>> print(length(999999)) # 6

# 8) напишите как мне установить библиотеку и как его удалить , библиотека
# называется flake8
# 9) У вас есть список чисел. Напишите код, чтобы создать новое
# множество, содержащее квадраты уникальных чисел из этого списка.

# 10) напишите функцию palindrome которая принимает в себе число и
# возвращает True если палиндром а если нет то False





